import psycopg2

# Установите соединение с базой данных
connection = psycopg2.connect(
    dbname="schedule",
    user="postgres",
    password="2505",
    host="localhost",
    port="5432"
)
cursor = connection.cursor()

# Данные расписания
schedule_data = [
    ('Понедельник', 1, '08:00:00','10:00:00', 'Математика', 'Иванов И.И.', '101'),
    ('Понедельник', 2, '10:00:00','12:00:00', 'Физика', 'Петров П.П.', '102'),
    ('Понедельник', 3, '12:00:00','14:00:00', 'Информатика', 'Сидоров С.С.', '103'),
    ('Вторник', 1, '08:00:00','10:00:00', 'Химия', 'Васильев В.В.', '201'),
    ('Вторник', 2, '10:00:00', '12:00:00', 'Биология', 'Александров А.А.', '202'),
    ('Вторник', 3, '12:00:00', '14:00:00','Литература', 'Михайлов М.М.', '203'),
    ('Среда', 1, '08:00:00', '10:00:00','История', 'Григорьев Г.Г.', '301'),
    ('Среда', 2, '10:00:00', '10:00:00','География', 'Кузнецов К.К.', '302'),
    ('Среда', 3, '12:00:00', '14:00:00', 'Физическая культура', 'Романов Р.Р.', '303'),
    ('Четверг', 1, '08:00:00', '10:00:00','Английский язык', 'Смирнов С.С.', '401'),
    ('Четверг', 2, '10:00:00', '12:00:00','Экономика', 'Киселев К.К.', '402'),
    ('Четверг', 3, '12:00:00', '14:00:00','Социология', 'Козлов К.К.', '403'),
    ('Пятница', 1, '08:00:00', '10:00:00','Право', 'Лебедев Л.Л.', '501'),
    ('Пятница', 2, '10:00:00', '12:00:00','Психология', 'Николаев Н.Н.', '502'),
    ('Пятница', 3, '12:00:00', '14:00:00','Философия', 'Морозов М.М.', '503')
]

# Вставка данных в таблицу
cursor.executemany("""
    INSERT INTO schedules (day, pair, time, end_time, subject, professor, room) 
    VALUES (%s, %s, %s, %s, %s, %s, %s)
""", schedule_data)

# Сохранение изменений
connection.commit()

# Закрытие соединения
cursor.close()
connection.close()

print("Данные успешно добавлены в таблицу schedules.")
